bend/bend_app/app/controllers/registrations_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["email", "user1@email.com"], ["username", "user1"], ["password_digest", "[FILTERED]"], ["created_at", "2025-03-29 21:11:27.420872"], ["updated_at", "2025-03-29 21:11:27.420872"]]