bend/bend_app/app/controllers/shorts_controller.rb

  def create
    puts "DOCS HERE"
    puts document_params
    @short = Short.create(document_params)
    if @short.save
      puts "SAVING"
      puts session[:user_id]
      if session[:user_id]
        Current.user = User.find_by(id: session[:user_id])
---
UPDATE "shorts" SET "user_id" = ?, "updated_at" = ? WHERE "shorts"."id" = ?  [["user_id", 1], ["updated_at", "2025-03-30 04:49:32.866323"], ["id", 4]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]