bend/bend_app/app/controllers/shorts_controller.rb

  def create
    @short = Short.new(document_params)
    if @short.save
---
INSERT INTO "shorts" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", nil], ["user_id", nil], ["created_at", "2025-03-30 03:28:56.601188"], ["updated_at", "2025-03-30 03:28:56.601188"]]

  def show
    if Current.user
      @shorts = Current.user.short
    end
    @short = Short.find(params[:id])
---
SELECT "shorts".* FROM "shorts" WHERE "shorts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def upvid
    puts "VIEWING VIDAAA"
    puts params[:id]
    @short = Short.find(params[:id])
    @short.vid.attach(vid_params[:vid])
    if @short.save
      Current.user.short << @short
---
SELECT "shorts".* FROM "shorts" WHERE "shorts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "shorts" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", nil], ["user_id", nil], ["created_at", "2025-03-30 05:16:08.997761"], ["updated_at", "2025-03-30 05:16:08.997761"]]
UPDATE "shorts" SET "updated_at" = ? WHERE "shorts"."id" = ?  [["updated_at", "2025-03-30 05:58:59.389043"], ["id", 1]]